examples/ctrlflowgraph/ctrl_switch_example1.cpp.puml
@startuml

card "::main() -> int" {
    :::check_switch(0);
    :::check_switch(1);
    :::check_switch(2);
    :::check_switch(3);
    #lightgreen:return 0;
    stop
    -[hidden]->
}

card "::check_switch(int const value) -> int" {
    :::printf((&"value: %i\\n"), value);

partition "switch:\nvalue" {
    ' case: 0 fallthrough: True
    if ( 0 ? ) then (yes)
        :::printf((&"    case 0 (with fallthrough)\\n"));
    endif
    ' case: 1 fallthrough: False
    if ( 1 ? ) then (yes)
        :::printf((&"    case 1\\n"));
    else
        ' case: 2 fallthrough: False
        if ( 2 ? ) then (yes)
            :::printf((&"    case 2\\n"));
        else
            ' case: None fallthrough: True
            if ( default ) then (yes)
                :::printf((&"    case default\\n"));
            else
                -[hidden]->
            endif
        endif
    endif
}
    #lightgreen:return value;
    stop
    -[hidden]->
}

card "::std::__is_constant_evaluated() -> bool" {
    #lightgreen:return 0;
    stop
    -[hidden]->
}

card "::std::__terminate() -> void" {
    :::std::terminate();
    -[hidden]->
}


@enduml
